package lessons.lesson06.homeworks

// Задание 1: "Определение сезона"
// Напишите функцию, которая на основе номера месяца распечатывает сезон года.
// Номера месяцев начинаются с единицы.
fun seasonOfYear(arg: Int) {
    lateinit var season: String

    when(arg){
        in 3..5 -> {season = "Spring"}
        in 6..8 -> {season = "Summer"}
        in 9..11 -> {season = "Autumn"}
    }

    if (arg == 12 || arg == 1 || arg == 2) {
        season = "Winter"
    }

    println(season)
}

// Задание 2: "Расчет возраста питомца"
// Создайте функцию, которая преобразует возраст собаки в "человеческие" годы.
// До 2 лет каждый год собаки равен 10.5 человеческим годам, после - каждый год равен
// 4 человеческим годам. Результат распечатай в консоль.
fun dogAge(arg: Int) {
    var age: Double = 0.0

    if (arg < 2) {
        age = arg * 10.5
    } else {
        age = arg * 4.0
    }

    println(age)
}

// Задание 3: "Определение способа перемещения"
// Напишите функцию, которая печатает в консоль, какой способ перемещения лучше использовать,
// исходя из длины маршрута. Если маршрут до 1 км - "пешком", до 5 км - "велосипед",
// иначе - "автотранспорт".
fun wayToGo(length: Float) {
    lateinit var way: String

    if (length < 1) {
        way = "пешком"
    } else if (length < 5) {
        way = "велосипед"
    } else {
        way = "автотранспорт"
    }

    println(way)
}

// Задание 4: "Расчет бонусных баллов"
// Клиенты интернет-магазина получают бонусные баллы за покупки. Напишите функцию,
// которая принимает сумму покупки и печатает в консоль количество бонусных баллов:
// 2 балла за каждые 100 рублей при сумме покупки до 1000 рублей и 3 балла за каждые
// 100 рублей при сумме свыше этого.
fun bonus(sum: Int) {
    var bonusCount: Int = 0
    if (sum < 1000){
        bonusCount = sum / 100 * 2
    } else {
        bonusCount = sum / 100 * 3
    }
    println(bonusCount)
}


// Задание 5: "Определение типа документа"
// В системе хранения документов каждый файл имеет расширение. Напишите функцию, которая
// на основе расширения файла печатает в консоль его тип: "Текстовый документ", "Изображение",
// "Таблица" или "Неизвестный тип".
fun docType(inType: String){
    var outType: String = ""
    if (inType == "txt") {outType = "Текстовый документ"}
    else if (inType == "webp"){ outType = "Изображение"}
    else if (inType == "xlsx"){ outType = "Таблица"}
    else { outType = "Неизвестный тип"}
    println(outType)
}


// Задание 6: "Конвертация температуры"
// Создайте функцию, которая конвертирует температуру из градусов Цельсия в Фаренгейты
// и наоборот в зависимости от указанной единицы измерения (C/F). Единицу измерения
// нужно передать вторым аргументом функции. Несколько аргументов передаются через запятую.
// Распечатай в консоль результат конвертации с добавлением единицы измерения.
// Чтобы добавить единицу измерения после результата используй функцию печати
// без переноса строки print("C") или print("F").
fun temp(deg: Int, ed: Char) {
    if (ed == 'C'){
        print(deg * 9/5 + 32)
        println('F')
    } else {
        print((deg - 32) * 5/9)
        println('C')
    }
}

// Задание 7: "Подбор одежды по погоде"
// Напишите функцию, которая на основе температуры воздуха рекомендует тип одежды:
// "куртка и шапка" при температуре ниже +10, "ветровка" от +10 до +18 градусов
// включительно и "футболка и шорты" при температуре выше +18 градусов.
// При температурах ниже -30 и выше +35 рекомендуйте не выходить из дома.
fun outfits(arg: Int){
    var message: String = ""
    if (arg <= -30)
    {message = "не выходить из дома"}
    if (arg >= 35)
    {message = "не выходить из дома"}
    when(arg){
        in -29..10 -> {message = "куртка и шапка"}
        in 11..18 -> {message = "ветровка"}
        in 19..34 -> {message = "футболка и шорты"}
    }
    println(message)
}

// Задание 8: "Выбор фильма по возрасту"
// Кинотеатр предлагает фильмы разных возрастных категорий.
// Напишите функцию, которая принимает возраст зрителя и возвращает
// доступные для него категории фильмов: "детские" (от 0 до 9),
// "подростковые" (от 10 до 18), "18+" для остальных.
fun film(arg: Int) {
    var message: String = ""
    when(arg){
        in 0..9 -> {message = "детские"}
        in 10..17 -> {message = "подростковые"}
    }
    if (arg >= 18)
    {message = "взрослые"}
    println(message)
}

fun main() {
    seasonOfYear(12)
    dogAge(3)
    wayToGo(5.78f)
    bonus(999)
    docType("xlsx")
    temp(1,'F')
    temp(1, 'C')
    outfits(1)
    film(8)
}