package lessons.lesson12.homeworks

val numbers = listOf(-1, -1,  2, -3, 4, -5, 8, 18, 22, 29, 264)
val symbols = listOf("a", "fgfedg", "dfgdg", "", null)
fun main () {
// Задачи на приведение коллекции к значению
// Проверить, что размер коллекции больше 5 элементов.
    println(numbers.size > 5)

// Проверить, что коллекция пустая
    println(numbers.isEmpty())

// Проверить, что коллекция не пустая
    println(numbers.isNotEmpty())

// Взять элемент по индексу или создать значение если индекса не существует
    println(numbers.getOrElse(10) {})

// Собрать коллекцию в строку
    println(numbers.joinToString())

// Посчитать сумму всех значений
    println(numbers.sum())

// Посчитать среднее
    println(numbers.average())

// Взять максимальное число
    println(numbers.max())

// Взять минимальное число
    println(numbers.min())

// Взять первое число или null
    println(numbers.firstOrNull())

// Проверить что коллекция содержит элемент
    println(numbers.contains(-1))

// Реши задачи подходящим методом для работы с коллекцией. Для каждой задачи есть свой метод, не повторяйся. Список методов в рекомендациях под заданиями.
// Задачи на обработку коллекций
// Отфильтровать коллекцию по диапазону 18-30
    println(numbers.filter {
        it in 18..30
    })

// Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(numbers.filter {
        it % 2 != 0 && it % 3 != 0
    })

// Очистить текстовую коллекцию от null элементов
    println(symbols.filterNotNull())

// Преобразовать текстовую коллекцию в коллекцию длин слов
    println(symbols.filterNotNull().map { it.length })

// Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(symbols.filterNotNull().associate { it.reversed() to it.length })

// Отсортировать список в алфавитном порядке
    println(symbols.filterNotNull().sorted())

// Взять первые 3 элемента списка
    println(symbols.take(3))

// Распечатать квадраты элементов списка
    println(numbers.map { it * it })

// Группировать список по первой букве слов
    println(symbols.filterNotNull().groupBy { it.firstOrNull()})

// Очистить список от дублей
    println(numbers.distinct())

// Отсортировать список по убыванию
    println(numbers.sortedDescending())

// Взять последние 3 элемента списка
    println(numbers.takeLast(3))




// Реши задачи ниже в отдельных функциях.

// Задача 24. Характеристика числовой коллекции
// Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when

// Если коллекция пустая - “Пусто”
// Если количество элементов меньше пяти - “Короткая”
// Если коллекция начинается с 0 - “Стартовая”
// Если сумма всех чисел больше 10000 - “Массивная”
// Если среднее значение равно 10 - “Сбалансированная”
// Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
// Если максимальное число меньше -10 - “Отрицательная”
// Если минимальное число больше 1000 - “Положительная”
// Если содержит одновременно числа 3 и 14 - “Пи***тая”
// Иначе - “Уникальная”
// Вызвать метод с данными, подходящими под каждую из веток
    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    fun grades(grades: List<Int>): String {
        return when {
            grades.isEmpty() -> "Пусто"
            grades.size < 5 -> "Короткая"
            (grades.firstOrNull() == 0) -> "Стартовая"
            (grades.sum() > 10000) -> "Массивная"
            (grades.average() == 10.0) -> "Сбалансированная"
            (grades.joinToString(separator = "").length == 20) -> "Клейкая"
            (grades.max() < -10) -> "Отрицательная"
            (grades.min() > 1000) -> "Положительная"
            (grades.contains(3) && grades.contains(14)) -> "Пи***тая"

            else -> "Уникальная"
        }
    }

    /* Задача 25. Анализ учебных оценок
Напиши функцию, которая принимает список чисел и возвращает список чисел.
Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
Цель: Отфильтровать удовлетворительные оценки (>=60),
отсортировать оставшиеся по возрастанию
и взять первые 3.
Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
*/
    val grades2 = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    fun myFilter(arg: List<Int>): List<Int> {
        val result = arg
            .filter{it >= 60 }
            .sorted()
            .take(3)
        return result
    }
    println(myFilter((grades2)))

    /* Задача 26. Создание каталога по первой букве
Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.

Начальные значения: val list = listOf(
    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
)

Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
*/

    /* Задание 27. Подсчёт средней длины слов в списке
Напиши функцию, которая принимает список строк и возвращает строку.

Начальные значения взять из предыдущей задачи.

Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
*/

    /* Задание 28: Категоризация чисел
Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.

Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)

Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
*/

    /* Задание 29: Поиск первого подходящего элемента
Напиши функцию, которая принимает список чисел и число и возвращает nullable число.

Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.

Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
*/
}
