package lessons.lesson13.homeworks

import lessons.lesson10.homeworks.mutableMap

fun main() {

//1. Дан словарь с именем и временем выполнения каждого автоматизированного теста в секундах. Определите среднее время выполнения теста.
    val testTime = mapOf("Первый" to 2, "Второй" to 46)
    val result = testTime
        .values
        .average()
    println(result)

//2. Имеется словарь с метаданными автоматизированных тестов, где ключи — это имена тестовых методов, а значения — строка с метаданными. Выведите список всех тестовых методов.
    println(testTime.keys)

//3. В изменяемый словарь с данными о прохождении тестов добавьте новый тест и его результат.
    val mM = mutableMapOf("Первый" to 2, "Второй" to 46)
    mM["Третий"] = 50
    println(mM)

//4. Посчитайте количество успешных тестов в словаре с результатами (ключ — название, значение — результат из `passed`, `failed`, `skipped`).
    val testResults = mapOf("Первый" to "passed", "Второй" to "failed", "Третий" to "skipped")
    val successTests = testResults.filter { it.value == "passed"}
    println(successTests)

//5. Удалите из изменяемого словаря с баг-трекингом запись о баге, который был исправлен (ключ — название, значение — статус исправления).
    val mMBTS = mutableMapOf("Первый" to "Исправлен", "Второй" to "Исправлен", "Третий" to "Создан")
    mMBTS.entries.removeAll { it.value == "Исправлен" }
    println(mMBTS)

//6. Для словаря с результатами тестирования веб-страниц (ключ — URL страницы, значение — статус ответа) выведите сообщение о странице и статусе её проверки.
    val webPages = mapOf("www" to 200, "http" to 500)
    for ((key, value) in webPages) {
        println("URL: $key, Status: $value")
    }

//7. Найдите в словаре с названием и временем ответа сервисов только те, время ответа которых превышает заданный порог.
    val responseTime = mapOf("1" to 10, "2" to 5, "3" to 9)
    val badResponseTime = responseTime.filterValues { it > 5 }
    println(badResponseTime)

//8. В словаре хранятся результаты тестирования API (ключ — endpoint, значение — статус ответа в виде строки).
// Для указанного endpoint найдите статус ответа; если endpoint отсутствует, предположите, что он не был протестирован.
    val resultAPI = mutableMapOf("Первый" to "Успех", "Второй" to "Фейл", "Третий" to "Фейл")
    println(resultAPI.getOrElse("Первый") { "Не был протестирован" })

//9. Из словаря, содержащего конфигурации тестового окружения (ключ — название параметра конфигурации, значение — сама конфигурация),
// получите значение для `"browserType"`. Ответ не может быть `null`.
    val configValues = mutableMapOf("browserType" to "Chrome", "OSType" to "Windows")
    println(configValues.getValue("browserType"))

//10. Создайте копию неизменяемого словаря с данными о версиях тестируемого ПО, добавив новую версию.
    val versions = mapOf("Первый" to "1.0.0", "Второй" to "1.0.5")
    val versions2 = versions + ("Третий" to "3.5")
    println(versions2)

//11. Используя словарь с настройками тестирования для различных мобильных устройств (ключ — модель устройства, значение — строка с настройками), получите настройки для конкретной модели или верните настройки по умолчанию.
    val mobile = mutableMapOf("Устройство 1" to "Настройка 1", "Устройство 2" to "Настройка 1 и настройка 2", "Устройство 3" to "Настройки по умолчанию")
    println(mobile.getOrElse("Устройство 4") { "Настройки по умолчанию" })

//12. Проверьте, содержит ли словарь с ошибками тестирования (ключ — код ошибки, значение — описание ошибки) определённый код ошибки.
    val errors = mapOf(404 to "Not Found", 500 to "Internal Server Error", 403 to "Forbidden")
    println(errors.containsKey(500))

//13. Дан неизменяемый словарь, где ключи — это идентификаторы тестовых сценариев в формате `"TestID_Version"`, а значения — статусы выполнения этих тестов (`"Passed"`, `"Failed"`, `"Skipped"`). Отфильтруйте словарь, оставив только те сценарии, идентификаторы которых соответствуют определённой версии тестов, то есть в ключе содержится требуемая версия.

//14. У вас есть словарь, где ключи — это названия функциональных модулей приложения, а значения — результаты их тестирования. Проверьте, есть ли модули с неудачным тестированием.
    val modules = mapOf("microService1" to "OK", "microService2" to "OK")
    println(modules.containsValue("NOT OK"))

//15. Добавьте в изменяемый словарь с настройками тестовой среды настройки из другого словаря.
    val m = mutableMapOf("Первый" to 2, "Второй" to 46)
    m["Третий"] = 50
    println(m)

//16. Объедините два неизменяемых словаря с данными о багах.
    //.putAll(mapOf())

//17. Очистите изменяемый словарь с временными данными о последнем прогоне автоматизированных тестов.
    //.clear()

//18. Исключите из отчёта по автоматизированному тестированию те случаи, где тесты были пропущены (имеют статус `"skipped"`). Ключи — название теста, значения — статус.

//19. Создайте копию словаря с конфигурациями тестирования, удалив из него несколько конфигураций.

//20. Создайте отчёт о тестировании, преобразовав словарь с результатами тестирования (ключ — идентификатор теста, значение — результат) в список строк формата `"Test ID: результат"`.

//21. Преобразуйте изменяемый словарь с результатами последнего тестирования в неизменяемый для архивации.

//22. Преобразуйте словарь, содержащий числовой ID теста и данные о времени выполнения тестов, заменив идентификаторы тестов на их строковый аналог (например, через `toString()`).

//23. Для словаря с оценками производительности различных версий приложения (ключи — строковая версия, значения — дробное число времени ответа сервера) увеличьте каждую оценку на 10%, чтобы учесть новые условия тестирования.

//24. Проверьте, пуст ли словарь с ошибками компиляции тестов.

//25. Убедитесь, что словарь с результатами нагрузочного тестирования не пуст.

//26. Проверьте, прошли ли успешно все автоматизированные тесты в словаре с результатами.

//27. Определите, содержит ли словарь с результатами тестирования хотя бы один тест с ошибкой.

//28. Отфильтруйте словарь с результатами тестирования сервисов, оставив только те тесты, которые не прошли успешно и содержат в названии `"optional"`.
}